export default [
  {
    id: 'fc0cc88e-200b-448b-b844-3a43d77d89c1',
    day: 1,
    month: 1,
    year: 2023,
    holiday_name: 'วันขึ้นปีใหม่'
  },
  {
    id: '7f56fb78-af0c-4d64-9d13-2f35b571cb8c',
    day: 2,
    month: 1,
    year: 2023,
    holiday_name: 'วันหยุดชดเชยวันขึ้นปีใหม่'
  },
  {
    id: 'b155fc83-a155-4d8d-a4d4-8efb38fb99b8',
    day: 6,
    month: 3,
    year: 2023,
    holiday_name: 'วันมาฆบูชา'
  },
  {
    id: '97e40308-9077-400c-9426-181bcbeb39d7',
    day: 6,
    month: 4,
    year: 2023,
    holiday_name: 'วันจักรี'
  },
  {
    id: 'a59a9737-7dca-4da0-8e2a-7a84a9cdbcac',
    day: 13,
    month: 4,
    year: 2023,
    holiday_name: 'วันสงกรานต์'
  },
  {
    id: 'c952d7a2-5519-4126-8191-22a56eee02c1',
    day: 14,
    month: 4,
    year: 2023,
    holiday_name: 'วันสงกรานต์'
  },
  {
    id: '4f675a6d-f7d3-48e3-88b5-087c280ec98b',
    day: 15,
    month: 4,
    year: 2023,
    holiday_name: 'วันสงกรานต์'
  },
  {
    id: '0e056ef5-0a8c-42d9-b07d-d7709c763eb2',
    day: 1,
    month: 5,
    year: 2023,
    holiday_name: 'วันแรงงานแห่งชาติ'
  },
  {
    id: 'b9721356-9442-4daf-a7f9-8347e8e93bbb',
    day: 4,
    month: 5,
    year: 2023,
    holiday_name: 'วันฉัตรมงคล'
  },
  {
    id: '2c3720b5-69c4-4699-af2e-bd454e27dfaa',
    day: 5,
    month: 6,
    year: 2023,
    holiday_name: 'ชดเชยวันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดาพัชรสุธาพิมลลักษณ พระบรมราชินี และวันวิสาขบูชา (วันเสาร์ที่ 3 มิถุนายน 2023)'
  },
  {
    id: 'f5e80bc7-fbbb-4297-bb6f-aef511593735',
    day: 28,
    month: 7,
    year: 2023,
    holiday_name: '​วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระเจ้าอยู่หัว'
  },
  {
    id: '50f48eaf-96af-4eb5-991c-5a0ee8e4048d',
    day: 1,
    month: 8,
    year: 2023,
    holiday_name: 'วันอาสาฬหบูชา'
  },
  {
    id: '21d6a164-c4ef-4b82-a348-863254541afc',
    day: 14,
    month: 8,
    year: 2023,
    holiday_name: 'ชดเชยวันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถพระบรมราชชนนีพันปีหลวง และวันแม่แห่งชาติ (วันเสาร์ที่ 12 สิงหาคม 2023)'
  },
  {
    id: '7ae19c59-07af-4fc5-b766-4f753d15c7a3',
    day: 13,
    month: 10,
    year: 2023,
    holiday_name: '​วันคล้ายวันสวรรคตพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร'
  },
  {
    id: '45c0ed0a-d549-46df-b8e3-dc00ffd383af',
    day: 23,
    month: 10,
    year: 2023,
    holiday_name: 'วันปิยมหาราช'
  },
  {
    id: '21fd5c74-7e7f-4285-9279-586c8cfcef53',
    day: 5,
    month: 12,
    year: 2023,
    holiday_name: 'วันคล้ายวันพระบรมราชสมภพพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตรวันชาติ และวันพ่อแห่งชาติ'
  },
  {
    id: '3ca0e32e-3ca9-44ef-88dd-ca33d712363f',
    day: 11,
    month: 12,
    year: 2023,
    holiday_name: '​ชดเชยวันรัฐธรรมนูญ (วันอาทิตย์ที่ 10 ธันวาคม 2566)'
  },

  //-----------2024----------//
  {
    id: '7b2e0e80-afa9-4d73-979b-a108950b60bc',
    day: 1,
    month: 1,
    year: 2024,
    holiday_name: 'วันขึ้นปีใหม่'
  },
  {
    id: 'ba45d753-bc82-4124-a1f2-57230e9ae95c',
    day: 2,
    month: 1,
    year: 2024,
    holiday_name: 'วันหยุดชดเชยวันขึ้นปีใหม่'
  },
  {
    id: 'a2388fa7-7834-4c4f-97bd-dd3f1b39add4',
    day: 26,
    month: 2,
    year: 2024,
    holiday_name: 'วันหยุดชดเชย วันมาฆบูชา'
  },
  {
    id: '5bea9adf-da3c-41e7-b4b7-f842a970bd4f',
    day: 6,
    month: 4,
    year: 2024,
    holiday_name: 'วันจักรี'
  },
  {
    id: 'f99790a0-db40-4b96-963a-d09587c55559',
    day: 15,
    month: 4,
    year: 2024,
    holiday_name: 'วันสงกรานต์'
  },
  {
    id: '73942e86-80cb-4427-be36-58a62c228b9c',
    day: 16,
    month: 4,
    year: 2024,
    holiday_name: 'วันหยุดชดเชย วันสงกรานต์'
  },
  {
    id: 'a7b4dc7e-654b-4358-8d2e-83b4f3fe1840',
    day: 1,
    month: 5,
    year: 2024,
    holiday_name: 'วันแรงงานแห่งชาติ'
  },
  {
    id: '0ef548ec-6fdc-4870-aa17-7464aed89232',
    day: 4,
    month: 5,
    year: 2024,
    holiday_name: 'วันฉัตรมงคล'
  },
  {
    id: 'b78afe4c-e4dc-4dbb-8cd4-db369f88074a',
    day: 22,
    month: 5,
    year: 2024,
    holiday_name: 'วันวิสาขบูชา'
  },
  {
    id: '357be273-bf9e-4fe1-88d9-d633e402e882',
    day: 3,
    month: 6,
    year: 2024,
    holiday_name: 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดาพัชรสุธาพิมลลักษณ พระบรมราชินี'
  },
  {
    id: '577a12d3-67b6-4843-a3bc-40db370d5d2b',
    day: 20,
    month: 7,
    year: 2024,
    holiday_name: 'วันอาสาฬหบูชา'
  },
  {
    id: '99a391f3-6fa2-4138-a446-23bc18cf253b',
    day: 29,
    month: 7,
    year: 2024,
    holiday_name: '​ชดเชยวันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระเจ้าอยู่หัว (วันอาทิตย์ที่  28 กรกฎาคม 2024)'
  },
  
  {
    id: 'd4c7d6f6-8230-4223-8722-ca1718307bea',
    day: 12,
    month: 8,
    year: 2024,
    holiday_name: 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถพระบรมราชชนนีพันปีหลวง และวันแม่แห่งชาติ'
  },
  {
    id: '5cde6047-772d-45d5-b2b4-e9c628e775c3',
    day: 14,
    month: 10,
    year: 2024,
    holiday_name: 'ชดเชย​วันคล้ายวันสวรรคตพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร (วันอาทิตย์ที่  13 ตุลาคม 2024)'
  },
  {
    id: '5e1ef222-0475-41e6-810e-cbc2e95f2baa',
    day: 23,
    month: 10,
    year: 2024,
    holiday_name: 'วันปิยมหาราช'
  },
  {
    id: '048b0b6a-41af-4dfb-859d-c9028bb8edbb',
    day: 5,
    month: 12,
    year: 2024,
    holiday_name: 'วันคล้ายวันพระบรมราชสมภพพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตรวันชาติ และวันพ่อแห่งชาติ'
  },
  {
    id: '462a126a-0a50-47de-a532-43065986ced1',
    day: 10,
    month: 12,
    year: 2024,
    holiday_name: 'วันรัฐธรรมนูญ'
  },
  {
    id: '519e5d4c-6cd7-4445-808e-e6dbedf07a0c',
    day: 31,
    month: 12,
    year: 2024,
    holiday_name: 'วันสิ้นปี'
  },

  //-----------2025----------//
  {
    id: '47d0e383-196c-409f-b4ff-15592c69fd77',
    day: 1,
    month: 1,
    year: 2025,
    holiday_name: 'วันขึ้นปีใหม่'
  },
  {
    id: 'cc8876bf-3e76-4563-a801-96583405a4ce',
    day: 2,
    month: 1,
    year: 2025,
    holiday_name: 'วันหยุดชดเชยวันขึ้นปีใหม่'
  },
  {
    id: '5b9bc29e-7980-4bc0-9388-d13d01756150',
    day: 23,
    month: 2,
    year: 2025,
    holiday_name: 'วันมาฆบูชา'
  },
  {
    id: '2a6e6114-c8bf-4e1b-aaf0-0bb9f0c50ed4',
    day: 7,
    month: 4,
    year: 2025,
    holiday_name: 'ชดเชยวันจักรี (วันอาทิตย์ที่  6 เมษายน 2025)'
  },
  {
    id: '778be781-8d47-46c7-81af-839f8015f9ec',
    day: 14,
    month: 4,
    year: 2025,
    holiday_name: 'วันสงกรานต์'
  },
  {
    id: '4ed7db56-b73e-4d60-9cee-4b852f88846d',
    day: 15,
    month: 4,
    year: 2025,
    holiday_name: 'วันสงกรานต์'
  },
  {
    id: '7e20a838-3f5a-42d4-a9b9-61f122456391',
    day: 16,
    month: 4,
    year: 2025,
    holiday_name: 'ชดเชยวันสงกรานต์ (วันอาทิตย์ที่  13 เมษายน 2025)'
  },
  {
    id: 'd971245e-4826-40ed-93db-97a645247fd3',
    day: 1,
    month: 5,
    year: 2025,
    holiday_name: 'วันแรงงานแห่งชาติ'
  },
  {
    id: '9f9c47b0-2ca6-4c8e-a61b-f3860584e575',
    day: 5,
    month: 5,
    year: 2025,
    holiday_name: 'ชดเชยวันฉัตรมงคล (วันอาทิตย์ที่  4 พฤษภาคม 2025)'
  },
  {
    id: '28cd691b-8c59-420b-83cd-c58563029bcd',
    day: 12,
    month: 5,
    year: 2025,
    holiday_name: 'ชดเชยวันวิสาขบูชา (วันอาทิตย์ที่  11 พฤษภาคม 2025)'
  },
  {
    id: 'be3d89ce-bc14-42b7-8048-b94e0e62f8b6',
    day: 3,
    month: 6,
    year: 2025,
    holiday_name: 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดาพัชรสุธาพิมลลักษณ พระบรมราชินี'
  },
  {
    id: 'fa188c9d-8427-4921-98b7-f914c6cf2934',
    day: 10,
    month: 7,
    year: 2025,
    holiday_name: 'วันอาสาฬหบูชา'
  },
  {
    id: '95114cc8-d384-4739-b312-2cf679fa0a71',
    day: 28,
    month: 7,
    year: 2025,
    holiday_name: 'วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระเจ้าอยู่หัว'
  },
  
  {
    id: '7b9ac8e2-ea59-4a6e-b375-27ac24b98359',
    day: 12,
    month: 8,
    year: 2025,
    holiday_name: 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถพระบรมราชชนนีพันปีหลวง และวันแม่แห่งชาติ'
  },
  {
    id: 'bd8e26ef-c7bc-4e79-94bd-46301cb1286a',
    day: 13,
    month: 10,
    year: 2025,
    holiday_name: '​วันคล้ายวันสวรรคตพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร'
  },
  {
    id: '730d22c1-3f97-412f-9393-62098b7f61e2',
    day: 23,
    month: 10,
    year: 2025,
    holiday_name: 'วันปิยมหาราช'
  },
  {
    id: '983b7e29-7a66-4e98-a44f-f12d073619de',
    day: 5,
    month: 12,
    year: 2025,
    holiday_name: 'วันคล้ายวันพระบรมราชสมภพพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตรวันชาติ และวันพ่อแห่งชาติ'
  },
  {
    id: '9d4b4985-ae43-4a6b-80f0-0361aee6585c',
    day: 10,
    month: 12,
    year: 2025,
    holiday_name: 'วันรัฐธรรมนูญ'
  },
  {
    id: '71f712b7-16e7-440d-8d33-2cd332da4375',
    day: 31,
    month: 12,
    year: 2025,
    holiday_name: 'วันสิ้นปี'
  },

  //-----------2026----------//
  // {
  //   id: '10c4a2d0-e362-45cc-a638-763d8873409c',
  //   day: 1,
  //   month: 1,
  //   year: 2026,
  //   holiday_name: 'วันขึ้นปีใหม่'
  // },
  // {
  //   id: 'a99e6189-f29e-4d4e-905c-57d13014060c',
  //   day: 2,
  //   month: 1,
  //   year: 2026,
  //   holiday_name: 'วันหยุดชดเชยวันขึ้นปีใหม่'
  // },
  // {
  //   id: '16c92a35-30a3-434e-8c51-734c0d0f0b8f',
  //   day: 23,
  //   month: 2,
  //   year: 2026,
  //   holiday_name: 'วันมาฆบูชา'
  // },
  // {
  //   id: '8470eb19-15db-441d-b5c9-d69aea9731e4',
  //   day: 7,
  //   month: 4,
  //   year: 2026,
  //   holiday_name: 'ชดเชยวันจักรี (วันอาทิตย์ที่  6 เมษายน 2026)'
  // },
  // {
  //   id: '39ac52e4-1dfc-4641-b6ae-55ed4f0662a6',
  //   day: 14,
  //   month: 4,
  //   year: 2026,
  //   holiday_name: 'วันสงกรานต์'
  // },
  // {
  //   id: 'c555d7d1-2b5f-44d2-953d-64501450e86b',
  //   day: 15,
  //   month: 4,
  //   year: 2026,
  //   holiday_name: 'วันสงกรานต์'
  // },
  // {
  //   id: '8d92e1bb-f7bc-4384-8f46-68427650a8af',
  //   day: 16,
  //   month: 4,
  //   year: 2026,
  //   holiday_name: 'ชดเชยวันสงกรานต์ (วันอาทิตย์ที่  13 เมษายน 2026)'
  // },
  // {
  //   id: 'd116a0c6-e6d3-4d09-9c65-b7dd1bc59d18',
  //   day: 1,
  //   month: 5,
  //   year: 2026,
  //   holiday_name: 'วันแรงงานแห่งชาติ'
  // },
  // {
  //   id: '3ab4f449-b7bd-441a-859d-fccb2811955d',
  //   day: 5,
  //   month: 5,
  //   year: 2026,
  //   holiday_name: 'ชดเชยวันฉัตรมงคล (วันอาทิตย์ที่  4 พฤษภาคม 2026)'
  // },
  // {
  //   id: '257e5161-4854-4c47-b8e5-0ca12dc75d40',
  //   day: 12,
  //   month: 5,
  //   year: 2026,
  //   holiday_name: 'ชดเชยวันวิสาขบูชา (วันอาทิตย์ที่  11 พฤษภาคม 2026)'
  // },
  // {
  //   id: '4dd29c4c-27d7-4077-8eee-a19914c09ea0',
  //   day: 3,
  //   month: 6,
  //   year: 2026,
  //   holiday_name: 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสุทิดาพัชรสุธาพิมลลักษณ พระบรมราชินี'
  // },
  // {
  //   id: 'eb657321-4a23-4e10-b7e4-a7810f98fde9',
  //   day: 10,
  //   month: 7,
  //   year: 2026,
  //   holiday_name: 'วันอาสาฬหบูชา'
  // },
  // {
  //   id: 'b76695ee-c748-493f-948e-b88d26d58629',
  //   day: 28,
  //   month: 7,
  //   year: 2026,
  //   holiday_name: 'วันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระเจ้าอยู่หัว'
  // },
  
  // {
  //   id: '50d7ca2d-4e88-4317-bf51-0969dbbea90f',
  //   day: 12,
  //   month: 8,
  //   year: 2026,
  //   holiday_name: 'วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถพระบรมราชชนนีพันปีหลวง และวันแม่แห่งชาติ'
  // },
  // {
  //   id: '3f2d3e96-42c2-4cf5-9f32-0ac929842343',
  //   day: 13,
  //   month: 10,
  //   year: 2026,
  //   holiday_name: '​วันคล้ายวันสวรรคตพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร'
  // },
  // {
  //   id: '0b92a631-64d4-4009-94d2-e643067569e0',
  //   day: 23,
  //   month: 10,
  //   year: 2026,
  //   holiday_name: 'วันปิยมหาราช'
  // },
  // {
  //   id: '63dbf91e-611f-444f-bf2d-e6366e66c8ae',
  //   day: 5,
  //   month: 12,
  //   year: 2026,
  //   holiday_name: 'วันคล้ายวันพระบรมราชสมภพพระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตรวันชาติ และวันพ่อแห่งชาติ'
  // },
  // {
  //   id: '6c950cc5-fc91-4a1f-9ab3-aa485402ea3a',
  //   day: 10,
  //   month: 12,
  //   year: 2026,
  //   holiday_name: 'วันรัฐธรรมนูญ'
  // },
  // {
  //   id: '06d1a17d-c68a-4dcb-b51c-8c4767564106',
  //   day: 31,
  //   month: 12,
  //   year: 2026,
  //   holiday_name: 'วันสิ้นปี'
  // },
]