export default [
  {
    id: 'b35c7937-e099-4003-a998-a87133d6200b',
    name: 'การค้า'
  },
  {
    id: 'ef8f390e-9a94-4e81-9ecb-850b0f01f95d',
    name: 'กฎหมาย/การเงิน'
  },
  {
    id: '34f3d7e3-4e3f-4fc1-8915-f456c898df2d',
    name: 'ก่อสร้าง'
  },
  {
    id: 'ecf5ce69-b1cd-4f1f-9881-1100b36d95d2',
    name: 'อุตสาหกรรม'
  },
  {
    id: '105bfc5d-ec8d-4020-b37b-2c6bce68a34f',
    name: 'เกษตร'
  },
  {
    id: '45a618ad-174c-42a0-aa13-cc6cea336f75',
    name: 'การศึกษา'
  },
  {
    id: 'a4a18fba-d042-438e-864d-04e499bf2936',
    name: 'ประกัน'
  },
  {
    id: '1729271e-415e-4662-8538-09303ceff3d0',
    name: 'ปรึกษา'
  },
  {
    id: 'a1fd92a3-3f40-4abd-8bba-e18926a6826e',
    name: 'คอมพิวเตอร์ IT'
  },
  {
    id: 'ed62ce83-e692-4c51-b140-2dbcd64d941a',
    name: 'การท่องเที่ยว'
  },
  {
    id: 'e3ca94f3-a510-40a4-b812-87c197878cce',
    name: 'ราชการ/รัฐวิสาหกิจ/มูลนิธิ'
  },
  {
    id: 'cef90110-b7da-4d3a-b13d-ecd6dcdc2e65',
    name: 'พาณิชย์'
  },
  {
    id: 'e948e07a-253e-4aaf-b5b1-63cdd79be888',
    name: 'เขียน/พิมพ์'
  },
  {
    id: '99eb0cf8-a6df-416b-b9d3-d16c84609de4',
    name: 'บันเทิง'
  },
  {
    id: '0d99933c-e634-437e-a7b1-bfad07466180',
    name: 'โรงพยาบาล'
  },
  {
    id: 'bd7510b54-c828-4a88-a30f-f9b5fdc93c7b',
    name: 'การกีฬา'
  },
  {
    id: 'e0774443-8909-420a-a43a-427976e62f48',
    name: 'งานบริหาร'
  },
  {
    id: 'd586f62c-f9c0-484b-b5c3-6e43fa881e77',
    name: 'งานทั่วไป'
  },
  {
    id: 'd326ea56-b75e-4c47-81bf-d07a37de5bdc',
    name: 'มนุษย์ศาสตร์'
  },
  {
    id: '2aa2a838-5e5e-4ee0-ba58-ed92e0e72caf',
    name: 'สถาปนิก'
  },
  {
    id: 'a75f24aa-4dbd-472f-81f3-8d58e4d27598',
    name: 'ศิลปกรรมศาสตร์'
  },
  {
    id: '0202e201-beae-472f-ba5f-708d3d4562a9',
    name: 'สังคมสงเคราะห์'
  },
  {
    id: '26957bd2-8bf1-4768-91ea-043ec2f744c2',
    name: 'เศรษฐศาสตร์'
  },
  {
    id: '6e8f732c-0db3-4415-b1b7-85f7cee4ae9c',
    name: 'การจัดการพลังงาน/น้ำ/การบำบัดของเสีย'
  },
  {
    id: 'bcfc755e-bc04-416c-a745-5f3541f50cd5',
    name: 'การแสดง/ศิลปะ'
  },
  {
    id: '8a237ccc-3fc8-44fa-a346-2084f9fa85da',
    name: 'ปิโตรเลียม/เเก๊ส'
  },
  {
    id: 'f5b8a68a-9575-44e0-b0e9-694c842a08d4',
    name: 'การบิน'
  },
]